MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx340f128h.h
extern volatile __CHEACCbits_t CHEACCbits __asm__ ("CHEACC") __attribute__((section("sfrs"), address(0xBF884010)));
extern volatile uint32_t        CHEACCCLR __attribute__((section("sfrs"),address(0xBF884014)));
extern volatile uint32_t        CHEACCSET __attribute__((section("sfrs"),address(0xBF884018)));
extern volatile uint32_t        CHEACCINV __attribute__((section("sfrs"),address(0xBF88401C)));
#define CHETAG CHETAG
extern volatile uint32_t   CHETAG __attribute__((section("sfrs"), address(0xBF884020)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t LTYPE:1;
    uint32_t LLOCK:1;
    uint32_t LVALID:1;
    uint32_t LTAG:20;
    uint32_t :7;
    uint32_t LTAGBOOT:1;
  };
  struct {
    uint32_t w:32;
  };
} __CHETAGbits_t;
extern volatile __CHETAGbits_t CHETAGbits __asm__ ("CHETAG") __attribute__((section("sfrs"), address(0xBF884020)));
extern volatile uint32_t        CHETAGCLR __attribute__((section("sfrs"),address(0xBF884024)));
extern volatile uint32_t        CHETAGSET __attribute__((section("sfrs"),address(0xBF884028)));
extern volatile uint32_t        CHETAGINV __attribute__((section("sfrs"),address(0xBF88402C)));
#define CHEMSK CHEMSK
extern volatile uint32_t   CHEMSK __attribute__((section("sfrs"), address(0xBF884030)));
typedef struct {
  uint32_t :5;
  uint32_t LMASK:11;
} __CHEMSKbits_t;
extern volatile __CHEMSKbits_t CHEMSKbits __asm__ ("CHEMSK") __attribute__((section("sfrs"), address(0xBF884030)));
extern volatile uint32_t        CHEMSKCLR __attribute__((section("sfrs"),address(0xBF884034)));
extern volatile uint32_t        CHEMSKSET __attribute__((section("sfrs"),address(0xBF884038)));
extern volatile uint32_t        CHEMSKINV __attribute__((section("sfrs"),address(0xBF88403C)));
#define CHEW0 CHEW0
extern volatile uint32_t   CHEW0 __attribute__((section("sfrs"), address(0xBF884040)));
typedef struct {
  uint32_t CHEW0:32;
} __CHEW0bits_t;
extern volatile __CHEW0bits_t CHEW0bits __asm__ ("CHEW0") __attribute__((section("sfrs"), address(0xBF884040)));
#define CHEW1 CHEW1
extern volatile uint32_t   CHEW1 __attribute__((section("sfrs"), address(0xBF884050)));
typedef struct {
  uint32_t CHEW1:32;
} __CHEW1bits_t;
extern volatile __CHEW1bits_t CHEW1bits __asm__ ("CHEW1") __attribute__((section("sfrs"), address(0xBF884050)));
#define CHEW2 CHEW2
extern volatile uint32_t   CHEW2 __attribute__((section("sfrs"), address(0xBF884060)));
typedef struct {
  uint32_t CHEW2:32;
} __CHEW2bits_t;
extern volatile __CHEW2bits_t CHEW2bits __asm__ ("CHEW2") __attribute__((section("sfrs"), address(0xBF884060)));
#define CHEW3 CHEW3
extern volatile uint32_t   CHEW3 __attribute__((section("sfrs"), address(0xBF884070)));
typedef struct {
  uint32_t CHEW3:32;
} __CHEW3bits_t;
extern volatile __CHEW3bits_t CHEW3bits __asm__ ("CHEW3") __attribute__((section("sfrs"), address(0xBF884070)));
#define CHELRU CHELRU
extern volatile uint32_t   CHELRU __attribute__((section("sfrs"), address(0xBF884080)));
typedef struct {
  uint32_t CHELRU:25;
} __CHELRUbits_t;
extern volatile __CHELRUbits_t CHELRUbits __asm__ ("CHELRU") __attribute__((section("sfrs"), address(0xBF884080)));
#define CHEHIT CHEHIT
extern volatile uint32_t   CHEHIT __attribute__((section("sfrs"), address(0xBF884090)));
typedef struct {
  uint32_t CHEHIT:32;
} __CHEHITbits_t;
extern volatile __CHEHITbits_t CHEHITbits __asm__ ("CHEHIT") __attribute__((section("sfrs"), address(0xBF884090)));
#define CHEMIS CHEMIS
extern volatile uint32_t   CHEMIS __attribute__((section("sfrs"), address(0xBF8840A0)));
typedef struct {
  uint32_t CHEMIS:32;
} __CHEMISbits_t;
extern volatile __CHEMISbits_t CHEMISbits __asm__ ("CHEMIS") __attribute__((section("sfrs"), address(0xBF8840A0)));
#define CHEPFABT CHEPFABT
extern volatile uint32_t   CHEPFABT __attribute__((section("sfrs"), address(0xBF8840C0)));
typedef struct {
  uint32_t CHEPFABT:32;
} __CHEPFABTbits_t;
extern volatile __CHEPFABTbits_t CHEPFABTbits __asm__ ("CHEPFABT") __attribute__((section("sfrs"), address(0xBF8840C0)));
#define TRISB TRISB
extern volatile uint32_t   TRISB __attribute__((section("sfrs"), address(0xBF886040)));
typedef union {
  struct {
    uint32_t TRISB0:1;
    uint32_t TRISB1:1;
    uint32_t TRISB2:1;
    uint32_t TRISB3:1;
    uint32_t TRISB4:1;
    uint32_t TRISB5:1;
    uint32_t TRISB6:1;
    uint32_t TRISB7:1;
    uint32_t TRISB8:1;
    uint32_t TRISB9:1;
    uint32_t TRISB10:1;
    uint32_t TRISB11:1;
    uint32_t TRISB12:1;
    uint32_t TRISB13:1;
    uint32_t TRISB14:1;
    uint32_t TRISB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISBbits_t;
extern volatile __TRISBbits_t TRISBbits __asm__ ("TRISB") __attribute__((section("sfrs"), address(0xBF886040)));
extern volatile uint32_t        TRISBCLR __attribute__((section("sfrs"),address(0xBF886044)));
extern volatile uint32_t        TRISBSET __attribute__((section("sfrs"),address(0xBF886048)));
extern volatile uint32_t        TRISBINV __attribute__((section("sfrs"),address(0xBF88604C)));
#define PORTB PORTB
extern volatile uint32_t   PORTB __attribute__((section("sfrs"), address(0xBF886050)));
typedef union {
  struct {
    uint32_t RB0:1;
    uint32_t RB1:1;
    uint32_t RB2:1;
    uint32_t RB3:1;
    uint32_t RB4:1;
    uint32_t RB5:1;
    uint32_t RB6:1;
    uint32_t RB7:1;
    uint32_t RB8:1;
    uint32_t RB9:1;
    uint32_t RB10:1;
    uint32_t RB11:1;
    uint32_t RB12:1;
    uint32_t RB13:1;
    uint32_t RB14:1;
    uint32_t RB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTBbits_t;
extern volatile __PORTBbits_t PORTBbits __asm__ ("PORTB") __attribute__((section("sfrs"), address(0xBF886050)));
extern volatile uint32_t        PORTBCLR __attribute__((section("sfrs"),address(0xBF886054)));
extern volatile uint32_t        PORTBSET __attribute__((section("sfrs"),address(0xBF886058)));
extern volatile uint32_t        PORTBINV __attribute__((section("sfrs"),address(0xBF88605C)));
#define LATB LATB
extern volatile uint32_t   LATB __attribute__((section("sfrs"), address(0xBF886060)));
typedef union {
  struct {
    uint32_t LATB0:1;
    uint32_t LATB1:1;
    uint32_t LATB2:1;
    uint32_t LATB3:1;
    uint32_t LATB4:1;
    uint32_t LATB5:1;
    uint32_t LATB6:1;
    uint32_t LATB7:1;
    uint32_t LATB8:1;
    uint32_t LATB9:1;
    uint32_t LATB10:1;
    uint32_t LATB11:1;
    uint32_t LATB12:1;
    uint32_t LATB13:1;
    uint32_t LATB14:1;
    uint32_t LATB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATBbits_t;
extern volatile __LATBbits_t LATBbits __asm__ ("LATB") __attribute__((section("sfrs"), address(0xBF886060)));
extern volatile uint32_t        LATBCLR __attribute__((section("sfrs"),address(0xBF886064)));
extern volatile uint32_t        LATBSET __attribute__((section("sfrs"),address(0xBF886068)));
extern volatile uint32_t        LATBINV __attribute__((section("sfrs"),address(0xBF88606C)));
#define ODCB ODCB
extern volatile uint32_t   ODCB __attribute__((section("sfrs"), address(0xBF886070)));
typedef union {
  struct {
    uint32_t ODCB0:1;
    uint32_t ODCB1:1;
    uint32_t ODCB2:1;
    uint32_t ODCB3:1;
    uint32_t ODCB4:1;
    uint32_t ODCB5:1;
    uint32_t ODCB6:1;
    uint32_t ODCB7:1;
    uint32_t ODCB8:1;
    uint32_t ODCB9:1;
    uint32_t ODCB10:1;
    uint32_t ODCB11:1;
    uint32_t ODCB12:1;
    uint32_t ODCB13:1;
    uint32_t ODCB14:1;
    uint32_t ODCB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCBbits_t;
